{
    "2023-06-microfluidics-space-extraterrestrial-life-signatures": {
        "article_date_time": "11 hours ago",
        "article_title": "Microfluidics in space to detect extraterrestrial life signatures and monitor astronaut health",
        "article_url": "https://phys.org/news/2023-06-microfluidics-space-extraterrestrial-life-signatures.html",
        "article_desc": "In a new report now published in npj Microgravity, Zachary Estlack and a research team in mechanical engineering and space sciences at the University of Utah and the University of California, Berkeley, developed a microfluidic ..."
    },
    "2023-06-right-handed-blocks-life-rocky": {
        "article_date_time": "12 hours ago",
        "article_title": "Right-handed building blocks of life might have had a rocky start",
        "article_url": "https://phys.org/news/2023-06-right-handed-blocks-life-rocky.html",
        "article_desc": "Harvard University led research may have solved the puzzle of how life became molecularly right-handed. In the paper, \"Origin of biological homochirality by crystallization of an RNA precursor on a magnetic surface,\" published ..."
    },
    "2023-06-ultra-faint-metal-poor-star-cluster": {
        "article_date_time": "13 hours ago",
        "article_title": "Old, ultra-faint and metal-poor star cluster discovered",
        "article_url": "https://phys.org/news/2023-06-ultra-faint-metal-poor-star-cluster.html",
        "article_desc": "An international team of astronomers reports the discovery of a new star cluster (SC) as part of the DECam Local Volume Exploration (DELVE) survey. The newfound cluster, designated DELVE 6, is ultra-faint, metal-poor and ..."
    },
    "2023-06-demystify-unusual-geminids-meteor-shower": {
        "article_date_time": "10 hours ago",
        "article_title": "Researchers demystify the unusual origin of the Geminids meteor shower",
        "article_url": "https://phys.org/news/2023-06-demystify-unusual-geminids-meteor-shower.html",
        "article_desc": "The Geminids meteoroids light up the sky as they race past Earth each winter, producing one of the most intense meteor showers in our night sky."
    },
    "2023-06-intriguing-earthquakes-cosmic": {
        "article_date_time": "11 hours ago",
        "article_title": "The intriguing correlation between earthquakes and cosmic radiation",
        "article_url": "https://phys.org/news/2023-06-intriguing-earthquakes-cosmic.html",
        "article_desc": "There is a clear statistical correlation between global seismic activity and changes in the intensity of cosmic radiation recorded at the surface of our planet, potentially helping to predict earthquakes. Surprisingly, it ..."
    },
    "2023-06-discovery-white-dwarf-pulsar-star": {
        "article_date_time": "11 hours ago",
        "article_title": "Discovery of white dwarf pulsar sheds light on star evolution",
        "article_url": "https://phys.org/news/2023-06-discovery-white-dwarf-pulsar-star.html",
        "article_desc": "The discovery of a rare type of white dwarf star system provides new understanding into stellar evolution."
    },
    "2023-06-unveiling-hidden-stars-alma-attenuation": {
        "article_date_time": "11 hours ago",
        "article_title": "Unveiling the hidden stars: ALMA shines a light on dust attenuation",
        "article_url": "https://phys.org/news/2023-06-unveiling-hidden-stars-alma-attenuation.html",
        "article_desc": "Interstellar dust is a key component in galaxies. It favors star formation and drives the chemistry and physics of the interstellar medium. However, it hides the majority of stars in a way that it is impossible to observe ..."
    },
    "2023-06-scientists-trap-release-amplify-electromagnetic-mars": {
        "article_date_time": "12 hours ago",
        "article_title": "Scientists verify trap-release-amplify model by reproducing electromagnetic waves on Mars",
        "article_url": "https://phys.org/news/2023-06-scientists-trap-release-amplify-electromagnetic-mars.html",
        "article_desc": "Chinese scientists have reproduced the observed whistler mode chorus waves on Mars using data from the Mars Atmosphere and Volatile Evolution (MAVEN) mission and compared them with phenomena on the Earth. They found that ..."
    },
    "2023-06-scientists-benchmarks-extreme-space-weather": {
        "article_date_time": "7 hours ago",
        "article_title": "Scientists report 'benchmarks' for extreme space weather",
        "article_url": "https://phys.org/news/2023-06-scientists-benchmarks-extreme-space-weather.html",
        "article_desc": "High-energy 'relativistic' electronsвЂ”so-called \"killer\" electronsвЂ”are a major source of radiation damage to satellites and so understanding their patterns of activity is crucial. Bursts of charged particles and magnetic ..."
    },
    "2023-06-ninth-planet-solar": {
        "article_date_time": "8 hours ago",
        "article_title": "There could still be a ninth planet in our solar system. Here's why",
        "article_url": "https://phys.org/news/2023-06-ninth-planet-solar.html",
        "article_desc": ",We all used to think there were nine planets. But in 2006, the solar system was left with only eight planets, when Pluto was no longer classified as such. But is it still possible there is a planet out there beyond NeptuneвЂ”possibly ..."
    },
    "2023-06-astronomers-unbury-radio-emissions-ciza": {
        "article_date_time": "12 hours ago",
        "article_title": "Astronomers unbury radio emissions from CIZA galaxy cluster",
        "article_url": "https://phys.org/news/2023-06-astronomers-unbury-radio-emissions-ciza.html",
        "article_desc": "Astronomers have used a newly upgraded world-leading radio telescope to unbury the radio emissions from a galaxy cluster known as CIZA1359. The signal has until now been buried in noise from a nearby foreground object."
    },
    "2023-06-nearby-supernova-aliens-attention": {
        "article_date_time": "Jun 14, 2023",
        "article_title": "New nearby supernova could be used by aliens to get our attention",
        "article_url": "https://phys.org/news/2023-06-nearby-supernova-aliens-attention.html",
        "article_desc": "A team of astronomers from the University of Washington, the SETI Institute, Yale University and Smith College is searching the vicinity of a new supernova in the spiral arms of the Pinwheel Galaxy hoping to find a signal ..."
    },
    "2023-06-sun-coldest-region-secret-million-degree": {
        "article_date_time": "Jun 14, 2023",
        "article_title": "Sun's coldest region stores secret to heating million-degree corona, study finds",
        "article_url": "https://phys.org/news/2023-06-sun-coldest-region-secret-million-degree.html",
        "article_desc": "Nearly 5,000 kilometers above the sun's surface lies a century-old question for solar physicistsвЂ”how are temperatures in the star's upper atmosphere (corona) hundreds of times hotter than temperatures at the sun's visible ..."
    },
    "2023-06-key-block-life-saturn-moon": {
        "article_date_time": "Jun 14, 2023",
        "article_title": "Key building block for life found at Saturn's moon Enceladus",
        "article_url": "https://phys.org/news/2023-06-key-block-life-saturn-moon.html",
        "article_desc": "The search for extraterrestrial life in our solar system just got more exciting. A team of scientists including Southwest Research Institute's Dr. Christopher Glein has discovered new evidence that the subsurface ocean of ..."
    },
    "2023-06-astronomers-true-nature-quasar-sdss": {
        "article_date_time": "Jun 14, 2023",
        "article_title": "Astronomers investigate the true nature of quasar SDSS J0823+2418 with VODKA",
        "article_url": "https://phys.org/news/2023-06-astronomers-true-nature-quasar-sdss.html",
        "article_desc": "By conducting Varstrometry for Off-nucleus and Dual sub-Kpc AGN (VODKA), astronomers from the University of Illinois at Urbana-Champaign and elsewhere, have investigated a quasar known as SDSS J0823+2418. The study, published ..."
    },
    "2023-06-astronomers-link-dark-clumpiness-universe": {
        "article_date_time": "Jun 14, 2023",
        "article_title": "Astronomers discover new link between dark matter and clumpiness of the universe",
        "article_url": "https://phys.org/news/2023-06-astronomers-link-dark-clumpiness-universe.html",
        "article_desc": "In a study published today in the Journal of Cosmology and Astroparticle Physics, researchers at the University of Toronto reveal a theoretical breakthrough that may explain both the nature of invisible dark matter and the ..."
    },
    "2023-06-earth-faster-thought": {
        "article_date_time": "Jun 14, 2023",
        "article_title": "Study claims Earth was created much faster than we thought",
        "article_url": "https://phys.org/news/2023-06-earth-faster-thought.html",
        "article_desc": "When we walk around in our everyday life, we might not think of the Earth itself very often. But this planet is the foundation of our life. The air we breathe, the water we drink and the gravity that pins us to the ground."
    },
    "2023-06-plate-tectonics-required-emergence-life": {
        "article_date_time": "Jun 14, 2023",
        "article_title": "Plate tectonics not required for the emergence of life, argues study",
        "article_url": "https://phys.org/news/2023-06-plate-tectonics-required-emergence-life.html",
        "article_desc": "Scientists have taken a journey back in time to unlock the mysteries of Earth's early history, using tiny mineral crystals called zircons to study plate tectonics billions of years ago. The research sheds light on the conditions ..."
    },
    "2023-06-astronomers-scrutinize-scorching-hot-exoplanet": {
        "article_date_time": "Jun 14, 2023",
        "article_title": "Astronomers scrutinize scorching-hot exoplanet",
        "article_url": "https://phys.org/news/2023-06-astronomers-scrutinize-scorching-hot-exoplanet.html",
        "article_desc": "An international team led by Stefan Pelletier, a Ph.D. student at UniversitГ© de MontrГ©al's Trottier Institute for Research on Exoplanets have made a detailed study of the extremely hot giant exoplanet WASP-76 b."
    },
    "2023-06-foldable-phased-array-transmitters-lightweight-smaller": {
        "article_date_time": "Jun 14, 2023",
        "article_title": "Foldable phased-array transmitters developed for lightweight, smaller, and cost-efficient satellites",
        "article_url": "https://phys.org/news/2023-06-foldable-phased-array-transmitters-lightweight-smaller.html",
        "article_desc": "A newly designed foldable phased-array transmitter can help make satellites lightweight, smaller, and cost-efficient to launch, report scientists at Tokyo Tech. The transmitter is made of stacked layers of liquid crystal ..."
    }
}